In [2]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -1.063326 -0.543148 -1.234554 -1.018086
2013-01-02 -1.401438 -0.760297  0.081240  1.112000
2013-01-03  0.702004  2.716997  1.115748 -0.308109
2013-01-04  0.353185  1.498213  0.542101  0.430024
2013-01-05 -0.068486 -1.356454  1.927860  1.065377
2013-01-06  0.732105 -0.008515  1.162361  0.117866

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
df.head()

                   A         B         C         D
2013-01-01 -1.063326 -0.543148 -1.234554 -1.018086
2013-01-02 -1.401438 -0.760297  0.081240  1.112000
2013-01-03  0.702004  2.716997  1.115748 -0.308109
2013-01-04  0.353185  1.498213  0.542101  0.430024
2013-01-05 -0.068486 -1.356454  1.927860  1.065377

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.353185  1.498213  0.542101  0.430024
2013-01-05 -0.068486 -1.356454  1.927860  1.065377
2013-01-06  0.732105 -0.008515  1.162361  0.117866

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.124326  0.257799  0.599126  0.233179
std    0.912159  1.545384  1.093938  0.821655
min   -1.401438 -1.356454 -1.234554 -1.018086
25%   -0.814616 -0.706010  0.196455 -0.201615
50%    0.142350 -0.275831  0.828925  0.273945
75%    0.614800  1.121531  1.150708  0.906539
max    0.732105  2.716997  1.927860  1.112000

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.063326   -1.401438    0.702004    0.353185   -0.068486    0.732105
B   -0.543148   -0.760297    2.716997    1.498213   -1.356454   -0.008515
C   -1.234554    0.081240    1.115748    0.542101    1.927860    1.162361
D   -1.018086    1.112000   -0.308109    0.430024    1.065377    0.117866

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.018086 -1.234554 -0.543148 -1.063326
2013-01-02  1.112000  0.081240 -0.760297 -1.401438
2013-01-03 -0.308109  1.115748  2.716997  0.702004
2013-01-04  0.430024  0.542101  1.498213  0.353185
2013-01-05  1.065377  1.927860 -1.356454 -0.068486
2013-01-06  0.117866  1.162361 -0.008515  0.732105

In [17]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05 -0.068486 -1.356454  1.927860  1.065377
2013-01-02 -1.401438 -0.760297  0.081240  1.112000
2013-01-01 -1.063326 -0.543148 -1.234554 -1.018086
2013-01-06  0.732105 -0.008515  1.162361  0.117866
2013-01-04  0.353185  1.498213  0.542101  0.430024
2013-01-03  0.702004  2.716997  1.115748 -0.308109

In [18]:
df["A"]

2013-01-01   -1.063326
2013-01-02   -1.401438
2013-01-03    0.702004
2013-01-04    0.353185
2013-01-05   -0.068486
2013-01-06    0.732105
Freq: D, Name: A, dtype: float64

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.063326 -0.543148 -1.234554 -1.018086
2013-01-02 -1.401438 -0.760297  0.081240  1.112000
2013-01-03  0.702004  2.716997  1.115748 -0.308109

In [20]:
df.loc[dates[0]]

A   -1.063326
B   -0.543148
C   -1.234554
D   -1.018086
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -1.063326 -0.543148
2013-01-02 -1.401438 -0.760297
2013-01-03  0.702004  2.716997
2013-01-04  0.353185  1.498213
2013-01-05 -0.068486 -1.356454
2013-01-06  0.732105 -0.008515

In [22]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -1.401438 -0.760297
2013-01-03  0.702004  2.716997
2013-01-04  0.353185  1.498213

In [23]:
df.loc[dates[0], "A"]

-1.0633259366474253

In [24]:
df.at[dates[0], "A"]

-1.0633259366474253

In [25]:
df.iloc[3]

A    0.353185
B    1.498213
C    0.542101
D    0.430024
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.353185  1.498213
2013-01-05 -0.068486 -1.356454

In [27]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.401438  0.081240
2013-01-03  0.702004  1.115748
2013-01-05 -0.068486  1.927860

In [28]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.401438 -0.760297  0.081240  1.112000
2013-01-03  0.702004  2.716997  1.115748 -0.308109

In [29]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.543148 -1.234554
2013-01-02 -0.760297  0.081240
2013-01-03  2.716997  1.115748
2013-01-04  1.498213  0.542101
2013-01-05 -1.356454  1.927860
2013-01-06 -0.008515  1.162361

In [30]:
df.iloc[1, 1]

-0.7602968694222594

In [31]:
df.iat[1, 1]

-0.7602968694222594

In [32]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-03  0.702004  2.716997  1.115748 -0.308109
2013-01-04  0.353185  1.498213  0.542101  0.430024
2013-01-06  0.732105 -0.008515  1.162361  0.117866

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN  0.081240  1.112000
2013-01-03  0.702004  2.716997  1.115748       NaN
2013-01-04  0.353185  1.498213  0.542101  0.430024
2013-01-05       NaN       NaN  1.927860  1.065377
2013-01-06  0.732105       NaN  1.162361  0.117866

In [34]:
df2 = df.copy()

In [35]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [36]:
df2

                   A         B         C         D      E
2013-01-01 -1.063326 -0.543148 -1.234554 -1.018086    one
2013-01-02 -1.401438 -0.760297  0.081240  1.112000    one
2013-01-03  0.702004  2.716997  1.115748 -0.308109    two
2013-01-04  0.353185  1.498213  0.542101  0.430024  three
2013-01-05 -0.068486 -1.356454  1.927860  1.065377   four
2013-01-06  0.732105 -0.008515  1.162361  0.117866  three

In [37]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [38]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [39]:
df["F"] = s1

In [40]:
df.at[dates[0], "A"] = 0

In [41]:
df.iat[0, 1] = 0

In [42]:
df.loc[:, "D"] = np.array([5] * len(df))

In [43]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.234554  5.0  NaN
2013-01-02 -1.401438 -0.760297  0.081240  5.0  1.0
2013-01-03  0.702004  2.716997  1.115748  5.0  2.0
2013-01-04  0.353185  1.498213  0.542101  5.0  3.0
2013-01-05 -0.068486 -1.356454  1.927860  5.0  4.0
2013-01-06  0.732105 -0.008515  1.162361  5.0  5.0

In [44]:
df2 = df.copy()

In [45]:
df2[df2 > 0] = -df2

In [46]:
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.234554 -5.0  NaN
2013-01-02 -1.401438 -0.760297 -0.081240 -5.0 -1.0
2013-01-03 -0.702004 -2.716997 -1.115748 -5.0 -2.0
2013-01-04 -0.353185 -1.498213 -0.542101 -5.0 -3.0
2013-01-05 -0.068486 -1.356454 -1.927860 -5.0 -4.0
2013-01-06 -0.732105 -0.008515 -1.162361 -5.0 -5.0

In [47]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [48]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [49]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.234554  5.0  NaN  1.0
2013-01-02 -1.401438 -0.760297  0.081240  5.0  1.0  1.0
2013-01-03  0.702004  2.716997  1.115748  5.0  2.0  NaN
2013-01-04  0.353185  1.498213  0.542101  5.0  3.0  NaN

In [50]:
df1.dropna(how="any")

                   A         B        C    D    F    E
2013-01-02 -1.401438 -0.760297  0.08124  5.0  1.0  1.0

In [51]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.234554  5.0  5.0  1.0
2013-01-02 -1.401438 -0.760297  0.081240  5.0  1.0  1.0
2013-01-03  0.702004  2.716997  1.115748  5.0  2.0  5.0
2013-01-04  0.353185  1.498213  0.542101  5.0  3.0  5.0

In [52]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [53]:
df.mean()

A    0.052895
B    0.348324
C    0.599126
D    5.000000
F    3.000000
dtype: float64

In [54]:
df.mean(axis=1)

2013-01-01    0.941362
2013-01-02    0.783901
2013-01-03    2.306950
2013-01-04    2.078700
2013-01-05    1.900584
2013-01-06    2.377190
Freq: D, dtype: float64

In [55]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [56]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [57]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.297996  1.716997  0.115748  4.0  1.0
2013-01-04 -2.646815 -1.501787 -2.457899  2.0  0.0
2013-01-05 -5.068486 -6.356454 -3.072140  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [58]:
df.agg(lambda x: np.mean(x) * 5.6)

A     0.296212
B     1.950615
C     3.355106
D    28.000000
F    16.800000
dtype: float64

In [59]:
df.transform(lambda x: x * 101.2)

                     A           B           C      D      F
2013-01-01    0.000000    0.000000 -124.936851  506.0    NaN
2013-01-02 -141.825573  -76.942043    8.221493  506.0  101.2
2013-01-03   71.042846  274.960130  112.913701  506.0  202.4
2013-01-04   35.742325  151.619179   54.860662  506.0  303.6
2013-01-05   -6.930751 -137.273183  195.099423  506.0  404.8
2013-01-06   74.088980   -0.861714  117.630933  506.0  506.0

In [60]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [61]:
s

0    3
1    2
2    1
3    3
4    1
5    6
6    2
7    0
8    5
9    6
dtype: int32

In [62]:
s.value_counts()

3    2
2    2
1    2
6    2
0    1
5    1
Name: count, dtype: int64

In [63]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [64]:
s

0    3
1    2
2    0
3    3
4    2
5    4
6    0
7    5
8    0
9    1
dtype: int32

In [65]:
s.value_counts()

0    3
3    2
2    2
4    1
5    1
1    1
Name: count, dtype: int64